import TOBCoverImg from "../assets/tower-of-babel/cover.png";
import TOBCharImg01 from "../assets/tower-of-babel/character01.png";
import TOBCharImg02 from "../assets/tower-of-babel/character02.png";
import TOBCharImg03 from "../assets/tower-of-babel/character03.png";
import TOBCharImg04 from "../assets/tower-of-babel/character04.png";
import TOBCharImg05 from "../assets/tower-of-babel/character05.png";

export const WORKS_DATA = [
  {
    characters: [
    {
      name: "Anton Zapadov",
      transcribedName: "アントン・ゼパードフ",
      nickname: "アントン",
      id: "i4iu2u1q1o2eaiy",
      description: "",
      information: {
        past: "",
        dayActions: "",
        belongings: [],
        learningNote: [],
        victoryCondition: "",
        knowledge: {
          charType: ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","r","s","t","u","w","y","z"],
        },
      },
      isPlayer: false,
    },
    {
      name: "Azuma Noboru",
      transcribedName: "東間 昇",
      nickname: "昇",
      id: "x74ik163txn0b70",
      charImg: TOBCharImg01,
      description: "日本語塾「バベルの塔」の塾長。30代後半独身。2年前に塾を開き、あふれる熱意と抜群の指導力で評判を得ていた。近くの行方不明事件により経営不振に陥るが、塾生への熱意は変わらず経営を立て直すために画策している。好きな日本語は「鶏口牛後」。",
      information: {
        past: [
          {
            title: "私の正体",
            content: (
`私は、誘拐組織「TOB」の一員だ。
この組織は、日本に戸籍のない外国人や留学生をターゲットにし、
彼らを労働力や人身売買の対象として金を稼いでいる。

私がこの組織に加わったのは5年前。
それ以来、誘拐や詐欺など、数々の犯罪に手を染めてきた。
だが、ここ最近は思うように稼げなくなってきている。

まず、ターゲットを見つけるまでの労力がかかりすぎる。
ターゲットたちの行動も不安定で、計画通りにいかないことが増えた。
さらに、捜査官たちが本格的に動き出している気配がある。
このままでは、いずれ自分たちの身も危うくなる。
じわじわと胸を締め付けるかのような不安に襲われる。
ここで終わるわけにはいかない。`
            )
          },
          {
            title: "日本語塾について",
            content: (
`現状を打破すべく、私は一つの策を思いついた。
ターゲットを“向こうから”やって来るようにすればいい――と。

私は、外国人向けの日本語塾を開くことにした。
偽名と偽造書類を用い、「バベルの塔」という塾を立ち上げたのが2年前。
ターゲットが集まる場を作り、その中から利用しやすい者を選別する。
塾という表の顔を使えば、観察も自然にできるし、収入も得られる。
言ってみれば、一石三鳥の策だった。
我ながら天才的なビジネスセンスに感嘆しつつ、
開業の手続きを始めた。

しかし、予想以上の反響があった。
塾はじわじわと評判が広がり、多くの外国人が通ってくるようになった。
この人数の中から誰かを誘拐するのはリスクが高く、慎重にならざるを得なかった。
だが、塾の収入のおかげで、それなりの生活はできるようになった。

ただし、塾の業務が増えるにつれ、本来の“仕事”にまで手が回らなくなる。
そこで私は、事務と一部の授業を新入りのアントン・ゼパードフに任せることにした。

もちろん、誘拐の収入は塾の収入とは比べ物にならない。
だからこそ、まずはアントンには新人研修を兼ねて、
塾周辺で軽く“仕事”をさせる事にした。

近くで留学生が突如失踪すれば、不安は広まり、
「治安悪化」だの「神隠し」だのと噂を流すことで、
塾生は自然と人数を減らし、狙いやすい者が残る。
あとはその中でじっくりと選別していけばいいだろう。`
            )
          },
          {
            title: "アントンとの会話",
            content: (
`塾長室と事務室は、防音構造になっている。
組織に関する話が漏れることのないよう、念には念を入れている。
私自身も、必要がない限りは、室内であってもその手の話はしないようにしている。

ある日、すでに帰宅したアントンに電話をかけた。
彼はいつも早く帰る。聞けば、かなりの愛妻家らしい。
塾内でも、ことあるごとに妻の話をしていた。

私は彼に、初めて任せた“仕事”の感触を尋ねた。
すると彼は、軽い調子でこう答えた。

「マニュアル通りにやれば、意外と簡単ですね～」
「準備は簡単でしたけど……やっぱり実際に手を下すとなると、心が痛みます。
正直、もう誘拐はいやですね」

本音が漏れたようだが、すぐに妻の話題へと切り替えた。

「そういえば、最近妻に助けられたんですよ。仕事から帰ったとき――」

私は、聞き飽きた話を遮るように言った。

「お前、そういえば保険に入ってなかったよな？」
「仕事柄、いつ何があってもおかしくない。せめて金だけでも残せるようにしておけ」
「できるだけ高額な保険に入ったほうがいい。家族がいるなら、なおさらだ」

アントンの相槌を聞きながら続ける。

「必要なら、今の身分でも通るように書類を偽造してやる。少しコツがいるんだ」

「えっ、本当ですか！？ありがとうございます！」

スマホ越しに大きな声が響いた。思わず耳を離す。
手間のかかる作業になりそうだが、かわいい後輩のためだ。
――少しくらい頑張ってやるか。
そう思いながら、私は帰宅の支度を始めた。`
            )
          },
          {
            title: "気掛かり",
            content: (
`最近、妙なことが起きている。
塾生の持ち物が頻繁に無くなるのだ。
当初は人数が多いことによる勘違いかと思ったが、
生徒数が4人にまで減った今でも紛失は続いている。

しかも、最近では書類までもが消えるようになった。
これは偶然ではない。
――おそらく、捜査官が私のことを狙っているのだ。
一瞬、その事実に恐怖したが、チャンスとも思った。
コソコソ捜査をしているということは、
まだ確信に至る証拠は見つかっていない。
そこに、付け入る隙があるはずだ。

ターゲットを探るために仕掛けておいた防犯カメラを確認すると、
塾生の荷物を漁り、塾長室や事務室に忍び込む人影があった。
監視カメラの死角を縫うように動いているが、
複数のカメラに身体の一部が写っており、
日付や服装から推測すると、ナンの犯行で間違えない。
実際に、彼女は最近やたらと遅くまで塾に残っていた。

仕方がない。
このままでは自分の身が危うい。
ここで手を打たねば、すべてが終わってしまう。

隙をみてナンを始末するしかない。
遺体は“商品”として処理すればいい。
――これは、生き延びるための当然の判断だ。`
            )
          },
        ],
        dayActions: ``,
        belongings: [
          {
            title: "ピカピカのナイフ",
            description: "ピカピカで傷ひとつないナイフ。素人目には使用済みかは分からない。",
          },
          {
            title: "保険契約書",
            description: "とても高額な保険契約書。名義はAとなっている。",
          },
          {
            title: "塾生の名簿",
            description: "ナン・チェン に黒いペンで丸が付けられていて、となりに「警戒」と書かれている。",
          },
        ],
        learningNote: [],
        victoryCondition: ``,
        knowledge: ``,
      },
      isPlayer: true,
    },
    {
      name: "Tanah bin Hassan",
      transcribedName: "タナ・ビン・ハッサン",
      nickname: "タナ",
      id: "u8879s23u8epbw5",
      charImg: TOBCharImg02,
      description: "マレンシア共和国出身でマレン語を話す。20代後半独身。愛称は「タナ」。1年半前に入塾しており、現在のメンバーの中では最も長い。最近アントンと仲良く話している姿が目撃されているが、何か企んでいそうだ。好きな日本語は「出版」。",
      information: {
        past: [
          {
            title: "私の正体",
            content: (
`私は、誘拐組織「TOB」を追い続ける捜査官だ。
TOBは、詐欺・誘拐・殺人・強盗・人身売買・奴隷取引──
ありとあらゆる悪事に手を染める、極悪非道な組織である。

10年前、私は日本を旅行中にTOBに両親を殺された。
当時はただの学生だったが、その出来事がすべてを変えた。
深い悲しみと怒りの中で、私は誓った。
「必ずこの手で、TOBを壊滅させてやる」と。
復讐の炎は、今もなお私の中で燃え続けている。

そこから2年後、私は捜査官となり、
以来、ずっとTOBを追い続けたが、
組織は徹底的な効率化とマニュアル化により、
尻尾をつかむことさえ困難だった。

5年前、ついに小さな証拠が見つかった。
当時の新人の小さなミスから、ようやく糸口が見え始めたのだ。
わずかな手掛かりをもとに、情報を集め、
なんとかやつらの行動をを阻止できるようになってきた。

このまま捜査を続けていけば、
いつか必ず、悪しきTOBを壊滅させることができる──`
            )
          },
          {
            title: "発覚",
            content: (
`捜査を進めていたある日、ある噂を耳にした。
どうやら、TOBが新たな事業にを始めるというのだ。

……やつらの考えていることなど手に取るように分かる。
日本語塾を隠れ蓑に、外国人を集めては売り飛ばすつもりだろう。
ターゲットを探す手間を省くために、
“カモがネギを背負ってくる”ようなシステムを作る。
そんな都合のいい夢を見ているに違いない。

この10年でこれほどの好機はなかった。
ここ数年、手掛かりすら得られなかったが、
ようやく、チャンスが舞い降りてきたのだ。

もちろん噂は噂、すべて想像の域を出ない。
その日本語塾が本当にTOBとつながっているという確証はないのだ。
迂闊な行動は組織に警戒される恐れもある。
だが、この機を逃すわけにもいかない。
苦節10年、チャンスを無駄にするわけにはいかないのだ。
ある程度のリスクは仕方がない。
私は、塾に潜入する事に決めた。`
            )
          },
          {
            title: "潜入",
            content: (
`私は身分を偽り、塾に潜入することにした。
内部から証拠を掴むことができれば、組織を暴く突破口になる。

だが現実は甘くなかった。
半年間捜査を続けたが、塾は用心深く、
重要書類どころか紙切れ一枚も成果が得られなかった。
それどころか、塾生の数は日を追うごとに増えていく。
ひょっとすると、塾生の中にも組織の仲間がいるかもしれない。
下手な行動は命取りだ。
私はひとまず、塾全体の観察に徹することにした。`
            )
          },
          {
            title: "契約",
            content: (
`観察をしていたある日、一人の塾生が目についた。
「ナン」という女は、どうやらこっそり盗みを働いていたのだ。
本来なら私の管轄外だが、放っておけば捜査のノイズになりかねない。

そのとき、1つアイディアが頭をよぎった。
彼女の犯行は、私でも注意深く観察しなければ気づけなかった。
ならば、その腕前を活かしてもらえばいいではないか。

講義終了後、私はすぐにナンを呼び出し、問い詰めた。
犯行の証拠を突きつけると、彼女はすぐに白状し、
言い訳がましく、お金に困っていることも吐露しだした。
常習犯のようだが、一回もバレたことがないという。

私は彼女と取引をした。
塾長室に忍び込んで、盗聴器を設置すること。
その後、数か月にわたって継続的に書類を盗み出すこと。
まだ彼女には迷いがあった。
今更何を渋ることがあるのかと思ったが、
そんな状態で任務をさせるわけにはいかなかったので、
報酬を言い値で決めさせることにした。

こちらが生殺与奪の権を握っているため、
法外な値段(もともとしていることが違法だが)を言うことないだろう。
彼女は決めていたかのように即決で100万円を要求してきた。

任務のリスクに比べて安すぎて、ある意味で法外だが、
彼女なりの思惑を尊重して契約が成立した。`
            )
          },
          {
            title: "事件",
            content: (
`交渉から数か月後、近くで外国人留学生の失踪事件が起きた。
現在の身分では、表立った捜査はできない。
だが、長年やつらを追い続けてきた私には分かる。
間違いなくTOBの仕業だ。

ある程度簡単な仕事のわりに手口が荒いので、
新人の教育のためなのではないかと推測できる。
今の時代、違法組織といえど人手不足なのだろう。
近くで新人の教育、ということは、
塾内に新人の組織のメンバーがもう一人紛れているはずだ。

東間一人で、多忙な塾の仕事をしつつ、
更には組織の“仕事”をこなせるとは考えずらい。
調査の結果、それを裏付けるように、
塾長室と事務室は防音構造になっていた。
組織のメンバーが東間一人なら、防音なのは塾長室だけでいいだろう。

確証はないが、もう一人のTOBのメンバーは事務員のアントンという男だ。
こちらからもアントンと接触し、十分な証拠が集まり次第、
やっと組織を壊滅させることができる。
いや、なんなら“不可抗力”で殺してしまっても仕方がないだろう。
なぜなら、我々が正義で、やつらは悪なのだから──`
            )
          },
        ],
        dayActions: ``,
        belongings: [
          {
            title: "",
            description: "",
          }
        ],
        learningNote: [],
        victoryCondition: ``,
        knowledge: ``,
      },
      isPlayer: true,
    },
    {
      name: "Nord Martin",
      transcribedName: "ノール・マルタン",
      nickname: "ノール",
      id: "f73acn8o1bvfyoc",
      charImg: TOBCharImg03,
      description: "フランシア出身でフランシア語を話す。20代前半独身。愛称は「ノール」。日本のアニメが好きで日本語に興味を持ち始め、1年半前に翻訳者を目指して入塾。現在はフリーターだが、25歳までに仕事がとれるようになることを目標にしている。好きな日本語は「丸太」。",
      information: {
        past: ``,
        dayActions: ``,
        belongings: [
          {
            title: "",
            description: "",
          }
        ],
        learningNote: [],
        victoryCondition: ``,
        knowledge: ``,
      },
      isPlayer: true,
    },
    {
      name: "Yuka Zapadova",
      transcribedName: "ユウカ・ザパードワ",
      nickname: "ユウカ",
      id: "g9kafl13oesq9hm",
      charImg: TOBCharImg04,
      description: "ラシア出身でラシア語を話す。20代中盤で、今回の事件の被害者である「アントン」と結婚。愛称は「ユウカ」。半年前に夫である「アントン」が事務員として就職したのと同時に入塾。ロシア人と日本人のハーフ。好きな日本語は「ごめんなさい」。",
      information: {
        past: ``,
        dayActions: ``,
        belongings: [
          {
            title: "",
            description: "",
          }
        ],
        learningNote: [],
        victoryCondition: ``,
        knowledge: ``,
      },
      isPlayer: true,
    },
    {
      name: "Nan Chen",
      transcribedName: "ナン・チェン",
      nickname: "ナンナン",
      id: "c03d4avhp58e90c",
      charImg: TOBCharImg05,
      description: "シナア出身でシナア語を話す。10代後半独身。愛称は「ナンナン」もしくは「ナン」。1年前の1周年記念時に入塾。外国人留学生として日本に来て勉強を始めたが、行方不明事件があったので辞めようとしている。好きな日本語は「努力は実を結ぶ」。",
      information: {
        past: ``,
        dayActions: ``,
        belongings: [
          {
            title: "",
            description: "",
          }
        ],
        learningNote: [],
        victoryCondition: ``,
        knowledge: ``,
      },
      isPlayer: true,
    },
  ],
    meta: {
      title: "バベルの塔",
      englishLabel: "tower-of-babel",
      id: "a80qiu2quhzzaf2",
      GM: 0,
      playerCount: {
        min: 5,
        max: 5
      },
      playTimeMinutes: "60-90",
      author: "fuga",
      pageTypes: [
        {
          path: "",
          propertyName: "Cover",
        },
        {
          path: "synopsis",
          propertyName: "Synopsis",
        },
        {
          path: "character-select",
          propertyName: "CharacterSelect",
        },
        {
          path: "confirmation/:id",
          propertyName: "CharacterConfirmation",
        },
        {
          path: "character/:id",
          propertyName: "CharacterInfomation",
        },
        {
          path: "ending",
          propertyName: "Ending",
        },
      ],
      infoType: [
        "私の事情",  // 過去、当日、勝利条件
        "保有情報",  // 持ち物、学習ノート、間取り、等
        "言語知識",  // いろいろ
      ],
      coverImg: TOBCoverImg,
    },
    synopsis: (
`日本語塾「バベルの塔」、国籍や母語を問わず多くの留学生に日本語教育を提供し、
その熱意あふれる指導姿勢が評判を呼んでいた。
開塾2周年を目前に控え、日本語学習者間のコミュニティでじわじわと人気を集めていた矢先のことだ。

経営拡大を目指し、人材や設備への投資を進めようとしていた折に、
塾の周辺で留学生の行方不明事件が発生した。
治安悪化や誘拐組織の関与、さらには「神隠し」といった根拠のない噂が飛び交い、
当初20名ほどいた塾生はわずか4名にまで激減。経営不振に陥ってしまった。

事件からちょうど2週間後──開塾2周年を迎えた日、
何事もなく講義が終わり、皆が帰宅しようとしていたときに、
事務室で事務員兼講師のアントン・ゼパードフ（Anton Zapadov）が机の前で倒れているのが発見された。
前頭部から額にかけては大量の出血があり、右前腕部には無数の刺し傷が刻まれている。
さらに、正面の窓ガラスには油性ペンで「TOB」とだけ大きく書き残されていた。

あまりにも不自然な状況に誰もが言葉を失ったが、
誰一人として警察に通報しようとはしなかった。

おそらく、犯人はこの中にいるに違いない。
最悪の形で迎えた2周年のその日、疑心暗鬼の中、犯人探しが行われることとなった。`
    ),
  }
]